[
  {
    "id": 1,
    "image": "https://i.ibb.co/HTT3d10k/facebook.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "description": "Facebook is one of the world's most dominant social networking platforms, designed to keep users connected with friends, family, and communities across the globe. Since its inception, it has evolved into a multifaceted platform that allows users to create personal profiles, share life updates, post photos and videos, and engage in lively discussions on a vast array of topics. Beyond personal connections, Facebook serves as a powerful tool for information consumption, offering a dynamic News Feed where users can stay updated with current events, follow pages from businesses and public figures, and discover trending content. The platform fosters community building through Groups, enabling people with shared interests to connect and organize. It also features integrated communication tools, including the ability to message friends directly (often through its companion app, Messenger), conduct live video broadcasts, and use the Marketplace for buying and selling local items. Furthermore, Facebook offers an extensive event management system, making it easy to plan and track social gatherings. With continuous feature updates, Facebook remains central to digital life for billions, acting as a personal journal, a global news aggregator, and a vast social hub all in one mobile application, ensuring that users can connect, share, and discover wherever they are. Its robust infrastructure supports everything from simple text posts to complex interactive media, cementing its place as a foundational element of the modern internet experience.",
    "size": 90,
    "reviews": "12M",
    "ratingAvg": 4.2,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 7000000 }
    ]
  },
  {
    "id": 2,
    "image": "https://i.ibb.co/cKFd1t0g/messenger.png",
    "title": "Messenger",
    "companyName": "Meta Platforms, Inc.",
    "description": "Messenger, developed by Meta Platforms, Inc., serves as the dedicated real-time communication platform for Facebook users, offering far more than simple text messaging. It enables seamless instant messaging, high-quality voice calls, and reliable video calls, making it easy to connect with your friends, family, and colleagues around the world. The app is designed for speed and rich interaction, allowing users to send photos, videos, voice clips, and location information directly within their chats. Beyond one-on-one communication, Messenger supports group chats, which are perfect for planning events, coordinating team projects, or simply socializing with a group of friends. It features a wide array of engaging tools, including customizable chat themes, reaction emojis, stickers, and a variety of interactive games that can be played with contacts. Furthermore, the platform has evolved to integrate features like 'Rooms' for large video conferences and options for secure, end-to-end encrypted conversations. Many businesses also use Messenger for customer service and direct engagement, making it a crucial tool for professional and personal communication. The app’s continuous updates focus on improving privacy, speed, and user experience, ensuring that keeping in touch is fast, fun, and reliable, regardless of your geographical location or network conditions.",
    "size": 110,
    "reviews": "6.5M",
    "ratingAvg": 4.1,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 3500000 }
    ]
  },
  {
    "id": 3,
    "image": "https://i.ibb.co/FkxfyYpp/whatsapp.png",
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp LLC",
    "description": "WhatsApp Messenger has become the globally preferred platform for instant communication, offering a simple, reliable, and secure way to connect with anyone, anywhere, using just a phone number. Its core promise is free messaging and calling, utilizing your phone's internet connection rather than costly cellular minutes or SMS charges. A key differentiator is its commitment to user privacy, featuring end-to-end encryption for all messages, calls, photos, videos, and voice messages, ensuring that only the sender and recipient can read the content. The application supports a rich set of communication features, including one-on-one chats, large group chats for families or professional teams, high-definition voice and video calls, and the ability to share documents and status updates. The 'Status' feature allows users to share short, expiring updates similar to stories on other platforms. WhatsApp is constantly introducing new privacy controls and utility features, such as disappearing messages and multi-device support, making it an indispensable tool for billions worldwide. Its light footprint and efficiency make it accessible even on slower networks or older devices, solidifying its position as the ultimate mobile communication utility for both personal and business use, focused entirely on keeping conversations private and accessible.",
    "size": 85,
    "reviews": "11M",
    "ratingAvg": 4.3,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 2100000 },
      { "name": "5 star", "count": 7000000 }
    ]
  },
  {
    "id": 4,
    "image": "https://i.ibb.co/s9DndCzf/youtube.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "YouTube, the world's leading video-sharing platform owned by Google LLC, serves as a massive digital library and entertainment hub where billions of people come to watch, upload, and share video content. It hosts an unparalleled variety of videos, ranging from educational tutorials, documentaries, and news coverage to music videos, gaming streams, and vlogs from creators worldwide. The app offers a highly personalized experience, with algorithmic recommendations based on user history and preferences, ensuring that viewers constantly discover new and relevant content. Users can subscribe to their favorite channels, create playlists, and interact with content through comments, likes, and shares. For content creators, YouTube provides robust tools for monetization, audience analytics, and channel management, making it a viable career path for many. Features like YouTube Shorts cater to the growing demand for short-form video, while YouTube Live allows for real-time broadcasts. The platform is not just for entertainment; it is a primary source of information and skill-building for millions, cementing its role as an essential part of the digital media ecosystem. Its commitment to improving video quality, reducing buffering, and expanding its content moderation efforts ensures it remains the dominant force in online video.",
    "size": 125,
    "reviews": "20M",
    "ratingAvg": 4.5,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 15000000 }
    ]
  },
  {
    "id": 5,
    "image": "https://i.ibb.co/SD50VF1n/tiktok.png",
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "description": "TikTok has revolutionized social media with its highly engaging, short-form video format, becoming a cultural phenomenon across the globe. Developed by TikTok Pte. Ltd., the application is a creative platform where users can easily produce captivating videos using a vast library of music, sound clips, and augmented reality effects. The core of TikTok's success is its highly sophisticated 'For You' page algorithm, which quickly learns user preferences and delivers an endless stream of tailored content, leading to incredibly high user engagement. Content on TikTok spans every possible niche, from comedy sketches, dance challenges, and lip-syncing videos to educational snippets and professional advice. The app empowers everyday users to become viral creators with minimal effort, lowering the barrier to entry for content production. Key features include intuitive editing tools, reaction videos, duets, and live streaming capabilities, fostering a highly interactive and community-driven environment. TikTok is more than just an entertainment app; it's a major driver of music trends, a source of global news, and a platform where cultural movements often originate, maintaining its position as a fast-paced, trend-setting digital media powerhouse.",
    "size": 95,
    "reviews": "9.5M",
    "ratingAvg": 4.4,
    "downloads": "3B",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 5800000 }
    ]
  },
  {
    "id": 6,
    "image": "https://i.ibb.co/8g45Xn0C/pubg.png",
    "title": "PUBG Mobile",
    "companyName": "Level Infinite",
    "description": "PUBG Mobile stands as one of the world's premier mobile battle royale experiences, bringing the intensity of large-scale survival combat to smartphones and tablets. Developed by Level Infinite, the game drops up to 100 players onto a remote island where they must scavenge for weapons, vehicles, and supplies while fighting to be the last person or squad standing. The game is renowned for its realistic graphics and detailed environment, which offer a truly immersive and competitive experience. It features various maps, game modes, and seasonal events that keep the gameplay fresh and engaging for a massive global audience. The mobile version is meticulously optimized, providing smooth controls and high-quality audio that allow for precise shooting and tactical maneuvering. Beyond the classic battle royale, players can engage in fast-paced modes like Team Deathmatch and specialized zombie survival events. Regular updates introduce new weapons, skins, vehicles, and collaborative content, maintaining its position at the forefront of the mobile gaming market. PUBG Mobile is not just a game; it's a social platform where players form squads, coordinate strategies using in-game voice chat, and compete in global eSports tournaments, fostering a dedicated and highly competitive community.",
    "size": 750,
    "reviews": "22M",
    "ratingAvg": 4.3,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 15000000 }
    ]
  },
  {
    "id": 7,
    "image": "https://i.ibb.co/0y40msZt/mobilelegends.png",
    "title": "Mobile Legends: Bang Bang",
    "companyName": "Moonton",
    "description": "Mobile Legends: Bang Bang is a fast-paced, 5v5 Multiplayer Online Battle Arena (MOBA) game that has captivated millions of players with its intense real-time strategic battles. Developed by Moonton, the game distills the core mechanics of PC MOBAs into a highly optimized and accessible mobile experience. Two teams of five players clash on a classic three-lane map, aiming to destroy the opposing team's base while defending their own. Players select from a continuously expanding roster of diverse heroes, each with unique roles, skills, and strategic advantages, allowing for deep team compositions and customized playstyles. The game emphasizes teamwork, map awareness, and quick decision-making, with matches typically lasting around ten minutes, perfectly suited for mobile play. Regular updates bring new heroes, game modes, visually stunning skins, and competitive seasons, ensuring a constantly evolving meta. Mobile Legends boasts a robust competitive scene, from in-game ranked ladders to major regional and international eSports tournaments. The combination of easy-to-learn mechanics and high skill ceiling, alongside a passionate global community, secures its place as a top-tier mobile MOBA for players seeking thrilling, action-packed online battles.",
    "size": 200,
    "reviews": "7.5M",
    "ratingAvg": 4.4,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 4400000 }
    ]
  },
  {
    "id": 8,
    "image": "https://i.ibb.co/bjfCzcbH/freefire.png",
    "title": "Garena Free Fire",
    "companyName": "Garena International",
    "description": "Garena Free Fire is a hugely popular mobile battle royale game, specifically designed to offer a quick, exhilarating survival shooter experience optimized for a wide range of mobile devices. Developed by Garena International, the game features 50 players parachuting onto an isolated island to search for weapons and medical supplies, with the objective of being the last one alive. Unlike some of its competitors, Free Fire focuses on fast-paced, 10-minute matches, making it incredibly accessible for on-the-go gaming. Its smaller map size and faster pace lead to more frequent and intense engagements. The game incorporates a unique character system, where players can choose from various characters, each with a special skill that can impact gameplay. This system adds a layer of strategy and personalization. Continuous updates introduce new maps, themed events, cosmetic items, and collaboration content, ensuring the game environment remains fresh and engaging. Free Fire has cultivated a massive global community, particularly in emerging markets, driven by its lightweight requirements and emphasis on fun, rapid-fire action. It stands as a dominant force in the mobile eSports landscape, appealing to players who value speed, simplicity, and accessibility in their battle royale fix.",
    "size": 600,
    "reviews": "19M",
    "ratingAvg": 4.2,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 700000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 12000000 }
    ]
  },
  {
    "id": 9,
    "image": "https://i.ibb.co/xKRzQqK1/snackvideo.png",
    "title": "SnackVideo",
    "companyName": "Kuaishou Technology",
    "description": "SnackVideo, a short video platform created by Kuaishou Technology, offers users a vibrant space for watching and sharing fun, trending, and highly engaging short-form clips. Similar to other leading platforms in the short video space, SnackVideo is built around a powerful recommendation engine that quickly learns user preferences, presenting a continuous, personalized stream of content on its main feed. The app boasts a vast and diverse content library, covering everything from comedy and dance challenges to lifestyle vlogs, creative art, and local cultural content. It places a strong emphasis on user-generated content, providing a suite of easy-to-use editing tools, including filters, special effects, and a large selection of popular background music, making video creation accessible to anyone. SnackVideo aims to foster a close-knit community where users can interact through comments, likes, and direct sharing. It is particularly popular in several markets for its ability to promote local creators and regional trends. The platform actively hosts various challenges and campaigns to encourage creativity and participation, solidifying its role as an exciting, fast-growing player in the global digital entertainment landscape where short clips rule supreme.",
    "size": 80,
    "reviews": "4M",
    "ratingAvg": 4.1,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 1800000 }
    ]
  },
  {
    "id": 10,
    "image": "https://i.ibb.co/WNpgmJ9V/instagram.png",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "description": "Instagram, a visual social media platform owned by Meta Platforms, Inc., is dedicated to the sharing of photos, videos, and short-form content, allowing users to capture and share their life's moments in creative ways. Initially focused on stylized photo sharing, the app has evolved into a powerhouse of visual storytelling, incorporating multiple formats like 'Stories' for ephemeral content, 'Reels' for short, engaging videos, and 'IGTV' for longer-form video content. Users can build their profile by curating a feed of high-quality media, follow friends, celebrities, and businesses, and interact through likes, comments, and direct messages. The platform offers a wide range of filters, editing tools, and augmented reality effects to enhance shared content. Beyond personal use, Instagram is a vital marketing tool for brands and a significant discovery engine, driving trends in fashion, food, travel, and more. The 'Explore' tab utilizes powerful algorithms to recommend personalized content, ensuring users always find engaging new accounts and trending topics. With its strong emphasis on aesthetics and visual appeal, Instagram remains a critical platform for personal expression and digital influence, continuously integrating new commerce features and creative tools for its vast global user base.",
    "size": 110,
    "reviews": "15M",
    "ratingAvg": 4.4,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2700000 },
      { "name": "5 star", "count": 9500000 }
    ]
  },
  {
    "id": 11,
    "image": "https://i.ibb.co/ZphyF7k4/programminghero.png",
    "title": "Programming Hero",
    "companyName": "Programming Hero Ltd.",
    "description": "Programming Hero is an innovative and highly engaging mobile learning application designed to make coding fun, interactive, and accessible to absolute beginners. Developed by Programming Hero Ltd., the app uses a gamified approach to teach fundamental programming concepts, covering essential languages and frameworks like Web Development (HTML, CSS, JavaScript), Python, and others. The curriculum is structured around building real-world projects, which allows users to apply their knowledge immediately and see tangible results. Instead of traditional lectures, the app presents lessons through interactive challenges, quizzes, and storytelling, turning the often-daunting task of learning to code into an addictive mobile game. Users progress through different levels, earn badges, and compete with friends, maintaining motivation throughout the learning journey. Programming Hero is praised for its beginner-friendly interface and unique teaching methodology, which focuses on hands-on practice over theory overload. It provides a flexible pathway for individuals to acquire foundational coding skills directly from their smartphone, serving as an excellent entry point for aspiring developers who want to transition into more complex coding education or professional development careers. Its emphasis on practical application ensures learners are not just memorizing syntax but truly understanding how to build with code.",
    "size": 60,
    "reviews": "120K",
    "ratingAvg": 4.7,
    "downloads": "1M",
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 8000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 80000 }
    ]
  },
  {
    "id": 12,
    "image": "https://i.ibb.co/YB40yHcy/nagad.png",
    "title": "Nagad",
    "companyName": "Bangladesh Post Office",
    "description": "Nagad is a leading digital financial service (DFS) in Bangladesh, operated by the Bangladesh Post Office, designed to bring secure, fast, and accessible mobile financial transactions to the masses. The platform allows users to perform a wide range of essential financial activities directly from their mobile phones, including sending and receiving money (P2P), cashing in and out at authorized agents, paying utility bills, and purchasing mobile airtime. Nagad plays a crucial role in promoting financial inclusion, particularly among the unbanked and underbanked populations in rural and remote areas. Its system is built on modern technology, offering high-level security protocols and a convenient user experience through both its smartphone application and a basic USSD (Unstructured Supplementary Service Data) service for feature phone users. The platform is often utilized for government disbursement of various social safety net payments and stipends, highlighting its reliability and widespread reach. By digitizing transactions and offering competitive rates, Nagad continues to expand its services and partnerships, making everyday financial management simpler, more efficient, and fully secure for millions of users across the country.",
    "size": 48,
    "reviews": "2.2M",
    "ratingAvg": 4.3,
    "downloads": "20M",
    "ratings": [
      { "name": "1 star", "count": 80000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 1300000 }
    ]
  },
  {
    "id": 13,
    "image": "https://i.ibb.co/LDp8Gv7r/toffee.png",
    "title": "Toffee",
    "companyName": "BanglaLink Digital",
    "description": "Toffee is a comprehensive digital entertainment platform and OTT (Over-The-Top) service provided by Banglalink Digital, catering to the growing demand for mobile video content and live streaming in Bangladesh. The application offers a single-stop destination for users to watch a diverse range of content, including live television channels, a massive library of on-demand movies, popular web series, and exclusive sporting events. Toffee is designed to deliver a high-quality streaming experience with adaptive bitrate technology, ensuring smooth playback across varying network conditions. It features a user-friendly interface that allows for easy navigation and content discovery, with curated categories and personalized recommendations. Crucially, the platform often hosts local and original content, giving a stage to emerging Bangladeshi creators and productions, which helps to enrich the local digital entertainment ecosystem. The availability of both free and premium content, along with the ability to watch major sports tournaments, makes Toffee a compelling entertainment choice. Its commitment to providing a seamless, mobile-first viewing experience makes it a popular application for consumers who want instant access to a full suite of multimedia entertainment anytime, anywhere on their smartphone.",
    "size": 75,
    "reviews": "1.8M",
    "ratingAvg": 4.0,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": 70000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 930000 }
    ]
  },
  {
    "id": 14,
    "image": "https://i.ibb.co/cKj05sYm/googlemaps.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "description": "Google Maps, a foundational application from Google LLC, is the indispensable digital tool for navigating the physical world, offering precise maps, turn-by-turn GPS navigation, and real-time traffic updates to billions globally. It provides detailed satellite imagery, street views, and 360° panoramic views of streets, allowing users to explore places virtually before visiting. The app is highly versatile, supporting navigation for various modes of transport, including driving, walking, cycling, and public transit, complete with live departure and arrival times. A standout feature is its real-time traffic information, which helps users avoid congestion and optimize their routes. Beyond navigation, Google Maps is a powerful local search engine, enabling users to discover nearby businesses, restaurants, points of interest, and services, complete with reviews, photos, and operating hours. Users can save maps for offline use, share their location, and contribute to the map data by adding reviews and photos. By continuously integrating new data, such as speed limits, accessibility information, and even indoor maps for certain venues, Google Maps remains the gold standard for geographical information and seamless navigation across the planet, serving as a vital utility for daily commuting and global travel.",
    "size": 145,
    "reviews": "9.5M",
    "ratingAvg": 4.6,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 5800000 }
    ]
  },
  {
    "id": 15,
    "image": "https://i.ibb.co/ZRMfRQKF/capcut.png",
    "title": "CapCut",
    "companyName": "Bytedance Pte. Ltd.",
    "description": "CapCut, developed by Bytedance Pte. Ltd., is a professional-grade, all-in-one video editing application specifically tailored for mobile users and, most notably, TikTok creators. It provides an incredibly comprehensive and user-friendly suite of editing tools, making high-quality video production accessible to everyone, regardless of their editing experience. The application features essential editing functions like trimming, cutting, speed control, and multi-track editing, alongside advanced capabilities such as keyframe animation, chroma key (green screen effect), and picture-in-picture. What sets CapCut apart is its vast library of trend-setting resources, including thousands of free music clips, sound effects, dynamic stickers, unique fonts, and a massive collection of visual effects and filters that are perfect for creating viral short-form content. The seamless integration with TikTok’s ecosystem allows creators to quickly and easily polish their videos for upload. Continuous updates introduce new features, templates, and creative assets, ensuring the app remains at the cutting edge of mobile video production. CapCut has become the preferred tool for a generation of mobile creators who demand powerful functionality and instant access to trendy effects for crafting compelling and highly polished video narratives on the go.",
    "size": 150,
    "reviews": "4M",
    "ratingAvg": 4.5,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 350000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 2500000 }
    ]
  },
  {
    "id": 16,
    "image": "https://i.ibb.co/0zkBRTS/snapchat.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Snapchat, developed by Snap Inc., is a groundbreaking social media platform centered on instant, ephemeral communication, encouraging users to share moments through quick snaps, chat, and engaging multimedia content. Its key features revolve around the camera, which is integrated with a vast and ever-changing collection of augmented reality (AR) filters and lenses. These lenses allow users to transform their appearance, interact with virtual objects, and share unique visual content. The platform is famous for its 'Stories,' which are collections of snaps that disappear after 24 hours, fostering a sense of immediate, authentic sharing. Snapchat also includes a dedicated 'Chat' section for instant messaging, video and voice calls, and the unique 'Snap Map' feature, which allows users to see the real-time location and activity of their friends. The 'Discover' page offers a curated feed of content from media publishers and creators. By prioritizing privacy through its ephemeral nature and consistently pushing the boundaries of AR technology, Snapchat remains a highly influential platform, particularly among younger demographics, serving as a fun, creative, and fast way to communicate and consume curated entertainment.",
    "size": 95,
    "reviews": "8.7M",
    "ratingAvg": 4.2,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 5300000 }
    ]
  },
  {
    "id": 17,
    "image": "https://i.ibb.co/6QwbTKX/subwaysurfers.png",
    "title": "Subway Surfers",
    "companyName": "SYBO Games",
    "description": "Subway Surfers, developed by SYBO Games, is one of the most downloaded and enduring endless running games in mobile history, offering a fast-paced, addictive, and visually vibrant gaming experience. In the game, players take on the role of youthful graffiti artists who are caught by an inspector and his dog, leading to an exhilarating chase down train tracks. The objective is simple: run for as long as possible, dodging oncoming trains, navigating obstacles, and collecting coins and power-ups along the way. The game is renowned for its smooth, intuitive swipe controls and dynamic three-lane track system. Regular updates introduce the 'World Tour,' which takes the chase to a new global city every few weeks, changing the scenery and introducing unique characters, hoverboards, and challenges inspired by local culture. Power-ups like jetpacks, super sneakers, and coin magnets add layers of strategy and excitement to the endless run. Subway Surfers maintains its massive popularity due to its fun, casual nature, its visually appealing graphics, and the constant introduction of fresh, diverse content. It remains a staple mobile game for players of all ages seeking a quick, engaging, and challenging high-score experience.",
    "size": 150,
    "reviews": "17M",
    "ratingAvg": 4.6,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 11500000 }
    ]
  },
  {
    "id": 18,
    "image": "https://i.ibb.co/XfN1kyYC/ludoking.png",
    "title": "Ludo King",
    "companyName": "Gametion Technologies Pvt Ltd",
    "description": "Ludo King, created by Gametion Technologies Pvt Ltd, has successfully digitized the classic, beloved board game of Ludo, making it the most popular mobile version of the game worldwide. The application faithfully recreates the traditional experience, allowing players to roll the dice and strategically race their four tokens from the starting block to the center of the board. Ludo King supports various playing modes, including a local multiplayer option where up to six players can play on a single device, and online multiplayer, where users can connect with friends on Facebook or challenge random opponents globally. The integration of voice chat and emoji reactions enhances the social experience, making the game highly interactive and fun. Additionally, the app includes other classic board games like Snakes & Ladders. Ludo King's simple yet nostalgic gameplay, coupled with its reliable online matchmaking and social features, has made it a cultural phenomenon, especially in South Asia and other regions. It provides a simple, fun, and competitive way to enjoy a traditional favorite with a massive online community, ensuring that the timeless joy of Ludo is preserved and popularized in the digital age.",
    "size": 65,
    "reviews": "10M",
    "ratingAvg": 4.3,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 5500000 }
    ]
  },
  {
    "id": 19,
    "image": "https://i.ibb.co/D3dPHYD/pinterest.png",
    "title": "Pinterest",
    "companyName": "Pinterest Inc.",
    "description": "Pinterest, developed by Pinterest Inc., functions as a unique visual discovery engine and digital mood board, designed to help users find, save, and organize ideas for virtually any topic imaginable. Users browse through millions of 'Pins'—images and videos—that link back to external websites, covering vast categories like home decor, fashion, recipes, DIY projects, travel destinations, and educational content. The platform encourages users to create and curate 'Boards' to categorize and save their favorite Pins, essentially acting as a personal visual bookmarking system for future inspiration and planning. Its robust visual search technology allows users to snap a photo or highlight a section of an image to find related ideas instantly. Pinterest is not just a social network; it is a powerful planning tool where people outline their wedding ideas, plan their next meal, or discover a new hairstyle. The app actively promotes creativity and a positive user experience, focusing on inspiration over social comparison. Its ability to serve highly personalized and niche content makes it an essential tool for anyone looking to organize their dreams, interests, and aspirations visually, connecting billions of ideas with millions of users globally.",
    "size": 85,
    "reviews": "4.2M",
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 2500000 }
    ]
  },
  {
    "id": 20,
    "image": "https://i.ibb.co/VW3ydNCM/googlechrome.png",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "description": "Google Chrome, developed by Google LLC, is the world's most widely used web browser across desktop and mobile platforms, known for its speed, security, and intuitive user interface. The Android version provides a seamless and powerful browsing experience, allowing users to effortlessly navigate the internet, search for information, and access web applications. Key features include lightning-fast page loading, efficient data compression for saving mobile data, and robust syncing capabilities that allow users to access their bookmarks, history, and saved passwords across all their devices. Chrome places a strong emphasis on security, offering built-in protections against malware and dangerous sites, alongside frequent security updates. It also supports incognito mode for private browsing and a wide array of customization options. The browser’s tab management is highly efficient, designed to handle multiple web pages without significant performance lag. Its deep integration with the Google ecosystem, including search and translation services, further enhances its utility. Google Chrome remains the essential gateway to the internet for billions of mobile users, providing a stable, secure, and fast platform for daily browsing, online work, and digital entertainment.",
    "size": 190,
    "reviews": "21M",
    "ratingAvg": 4.3,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 14200000 }
    ]
  }
]