[
  {
    "id": 1,
    "image": "https://i.ibb.co/qF7CSZgR/spotify.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "description": "Spotify is the ultimate music and podcast streaming platform, allowing you to explore millions of songs, albums, and podcasts from around the world anytime, anywhere. Whether you want to relax with calm acoustic tracks, pump up your energy with workout playlists, or discover the latest hits from emerging artists, Spotify has it all. You can create personalized playlists, follow your favorite artists, and enjoy curated recommendations that match your taste. The app also offers offline listening, letting you download your favorite songs and podcasts to enjoy without an internet connection. With high-quality audio streaming, seamless cross-device syncing, and smart playlist features like Daily Mix, Discover Weekly, and Release Radar, Spotify ensures every listening experience feels personal. Its intuitive interface, combined with features such as collaborative playlists and sharing options, makes music discovery social and fun. From chart-topping hits to niche genres and indie podcasts, Spotify provides endless entertainment for everyone, whether you’re a casual listener or a devoted music enthusiast.",
    "size": 120,
    "reviews": "13M",
    "ratingAvg": 4.5,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1100000 },
      { "name": "4 star", "count": 2600000 },
      { "name": "5 star", "count": 8100000 }
    ]
  },
  {
    "id": 2,
    "image": "https://i.ibb.co/RTPV858j/telegram.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "description": "Telegram is a highly secure, cloud-based messaging app designed for fast, reliable, and private communication. It allows you to send text messages, photos, videos, and files of any type seamlessly across devices. The app supports group chats with thousands of members, making it perfect for communities, teams, and social groups. Telegram’s advanced encryption ensures your conversations are safe, with optional secret chats that self-destruct for added privacy. Beyond messaging, Telegram offers features like channels for broadcasting to unlimited audiences, bots for automation, and extensive customization options for themes and notifications. With cross-platform availability, messages and media stay synchronized on all your devices, so you can continue your chats anywhere. Telegram’s speed, user-friendly interface, and rich multimedia support make it an all-in-one platform for personal, professional, and community interactions, whether you want to stay connected with friends or manage large online networks efficiently and securely.",
    "size": 85,
    "reviews": "9.8M",
    "ratingAvg": 4.4,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 5300000 }
    ]
  },
  {
    "id": 3,
    "image": "https://i.ibb.co/5X0XqJy7/netflix.png",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "description": "Netflix is the leading streaming platform for movies, TV series, documentaries, and original content that can be enjoyed anytime, anywhere. The app offers an extensive library of award-winning shows, blockbuster films, and trending releases that cater to every taste and age group. Netflix allows you to personalize your viewing experience with recommendations based on your preferences, helping you discover hidden gems and new favorites. You can create multiple profiles within one account, download content for offline viewing, and enjoy uninterrupted streaming with adaptive video quality. From gripping dramas and comedy specials to educational documentaries and anime, Netflix has something for everyone. Its intuitive interface makes browsing effortless, while features like skip intros, continue watching, and curated playlists enhance convenience. Netflix is more than just a streaming service — it’s a personalized entertainment hub that combines technology, creativity, and storytelling to bring cinematic experiences directly to your devices, making it the go-to platform for viewers worldwide.",
    "size": 160,
    "reviews": "25M",
    "ratingAvg": 4.3,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 1200000 },
      { "name": "3 star", "count": 1800000 },
      { "name": "4 star", "count": 4500000 },
      { "name": "5 star", "count": 16500000 }
    ]
  },
  {
    "id": 4,
    "image": "https://i.ibb.co/VW3ydNCM/chrome.png",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "description": "Google Chrome is a fast, secure, and easy-to-use web browser designed for seamless browsing across devices. With powerful features like safe browsing, tab management, and personalized search suggestions, Chrome ensures you can navigate the web efficiently. It supports extensions that enhance productivity, tools for developers, and synchronization across devices, allowing bookmarks, history, passwords, and settings to follow you wherever you go. Chrome’s built-in security protects against malware, phishing, and harmful sites while delivering a smooth browsing experience even on heavy websites. With its intuitive interface and lightning-fast performance, Chrome is ideal for casual users, students, professionals, and developers alike. It also integrates effortlessly with Google services, making tasks like searching, emailing, and cloud storage convenient and efficient. Whether you are streaming videos, managing work tasks, or exploring new information, Google Chrome offers reliability, speed, and an unmatched browsing experience.",
    "size": 190,
    "reviews": "21M",
    "ratingAvg": 4.3,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 14200000 }
    ]
  },
  {
    "id": 5,
    "image": "https://i.ibb.co/q340jB1N/snapchat.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Snapchat is a multimedia messaging app that allows you to share moments with photos, videos, and AR filters in a fun and creative way. You can send disappearing messages, create stories to share with friends, and explore trending content from around the world. The app’s augmented reality (AR) features let you transform your photos and videos with filters, lenses, and effects, making communication playful and engaging. Snapchat also provides private chat options, voice and video calls, and Bitmoji avatars for personalized interactions. With its innovative Discover section, users can stay updated with news, entertainment, and exclusive content from publishers. Snapchat’s combination of instant sharing, interactive AR experiences, and a social feed creates a dynamic platform where friends can connect, express themselves, and stay entertained. Its lightweight design ensures smooth performance on most devices, making it accessible and fun for everyone, whether casual users or social media enthusiasts.",
    "size": 95,
    "reviews": "8.7M",
    "ratingAvg": 4.2,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 5300000 }
    ]
  },
  {
    "id": 6,
    "image": "https://i.ibb.co/xKRzQqK1/snackvideo.png",
    "title": "SnackVideo",
    "companyName": "Kuaishou Technology",
    "description": "SnackVideo is a short video platform where users can create, discover, and share entertaining clips. It offers a wide variety of content including comedy skits, dance challenges, tutorials, and trending topics that keep users engaged for hours. The app allows you to follow favorite creators, like and comment on videos, and explore content through personalized feeds that adapt to your viewing habits. With easy-to-use editing tools, you can record videos, apply filters, and add music or effects to showcase your creativity. SnackVideo also fosters a community where users can interact, collaborate, and share their content globally. Its lightweight design ensures smooth playback, fast loading times, and accessibility on most devices. Whether you are a casual viewer, aspiring creator, or social media enthusiast, SnackVideo provides endless entertainment and a platform to express yourself creatively.",
    "size": 80,
    "reviews": "4M",
    "ratingAvg": 4.1,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 1800000 }
    ]
  },
  {
    "id": 7,
    "image": "https://i.ibb.co/dwv64BhC/instagram.png",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "description": "Instagram is a visual social media platform that lets you share photos, videos, stories, and reels to connect with friends and followers. It provides creative tools for editing, filters, and effects to enhance your content, while also offering ways to explore trending topics, influencers, and communities that match your interests. With features like direct messaging, live broadcasts, and interactive stories, Instagram fosters engagement and communication. Users can curate their profiles, discover new content through hashtags and the Explore page, and save posts for future reference. The app is designed to inspire creativity and enable users to express themselves visually while connecting with people around the world. Instagram also integrates shopping features, reels, and short video content, making it not just a social platform but a space for entertainment, creativity, and business opportunities. Its smooth interface and personalized feeds provide a seamless user experience for both casual users and creators.",
    "size": 110,
    "reviews": "15M",
    "ratingAvg": 4.4,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2700000 },
      { "name": "5 star", "count": 9500000 }
    ]
  },
  {
    "id": 8,
    "image": "https://i.ibb.co/D3dPHYD/pinterest.png",
    "title": "Pinterest",
    "companyName": "Pinterest Inc.",
    "description": "Pinterest is a visual discovery and bookmarking platform that helps users find inspiration for various aspects of life, including home decor, fashion, recipes, travel, and DIY projects. Users can browse thousands of ideas, save pins to boards, and organize them according to themes or projects. Pinterest provides personalized recommendations based on your interests, making it easy to discover new trends and creative ideas. Users can also share their creations, follow other users, and participate in communities focused on shared interests. The app supports rich media content including images, videos, and step-by-step tutorials, making it a versatile platform for both personal inspiration and professional design ideas. Whether planning a wedding, redecorating a room, or exploring new hobbies, Pinterest provides an endless stream of creative possibilities, helping users bring ideas to life in practical and visually appealing ways.",
    "size": 85,
    "reviews": "4.2M",
    "ratingAvg": 4.5,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 2500000 }
    ]
  }
]
